import React from 'react'
import { BlogTemp } from './blog-temp/blogtemp'
export const Test = () => {
    const data = {
        heading: "Хэрхэн ажлаа хойш тавихаа багасгах вэ?",
        image: "https://images.unsplash.com/photo-1509225770129-fbcf8a696c0b?ixid=MnwxMjA3fDB8MHxzZWFyY2h8MXx8cGFub3JhbWF8ZW58MHx8MHx8&ixlib=rb-1.2.1&w=1000&q=80",
        publisher: "Vici Magazine",
        publisher_profile: "https://frspros.com/images/easyblog_shared/July_2018/7-4-18/b2ap3_large_totw_network_profile_400.jpg",
        publisher_uid: "publisher_uid",
        accessed: 2383,
        date: "YYYY/MM/DD",
        body: [
            {
                heading: "Ажлыг хойш тавина гэж юу вэ?",
                text: [`Хойш тавих гэдэг үг нь Латин үгнээс гаралтай ба "маргаашид харъяалагдана" гэсэн утгатай үг юм. Хойш тавих нь аливаа зүйлийг санаатайгаар эсвэл зуршлаар хойшлуулах явдал юм. Өөрөөр хэлбэл, аливаа нэг ажил эсхүл даалгаварыг хийх болоход үр бүтээлтэй байж чадахгүй байхыг хэлнэ.`]
            }, {
                heading: `Бид яагаад юмыг хойш тавьдаг вэ?`,
                text: [`Хэзээ нэгэн цагт бид бүгд өөрсдөөсөө "Хойш тавих  нь бидний хувьд сайн зүйл биш гэдгийг мэдсээр байж яагаад хойш сууж байна вэ?" гэж асууж байсан байх.`]
            }, {
                heading: `Өмнөх хойш тавьсан явдлууддаа битгий харамс`,
                text: [`Тодорхой цаг үед өөрийгөө уучлах нь бидэнд сайнаар нөлөөлдөг. Өөрийгөө уучлахгүй явах  нь стрессийн үндсэн шалтгаануудын нэг юм.`]
            }, {
                heading: `Зорилгоо тогтоох`,
                text: [`Зорилготой байх нь өөрийгөө урамшуулах нэг арга юм. Гэхдээ аливаа зүйл хийх ёстой тодорхой хугацаатай байдаг тул аль ажлаа түрүүлж хийхээ мэдэх нь илүү чухал юм.`]
            },
            {
                heading: `Дүгнэлт`,
                text: [`Дээрх дурдсан бүх зүйлийг нэгтгэн дүгнэвэл, бид хойш тавих зуршлаа бүрэн зогсоож чадахгүй. Гэхдээ эдгээр зүйлсийг амьдралдаа тусгаж, үүнийг дадал зуршил болгох нь таны хойш тавих зуршлыг багасгаж чадна. Цаашилбал, илүү бодлоготой, төлөвлөгөөтэй мөн тууштай байгаарай.`,
                `Ажлаа хойш тавьж байгаагаа мэдэх нь илүү үр бүтээлтэй мөн хувийн сахилга баттай байхад чухал үүрэг гүйцэтгэдэг. Хүмүүсийн хойш тавьдаг нийтлэг шалтгаан бол хүсэл эрмэлзэл, хувийн сахилга бат, өөрийгөө үнэлэх чадваргүй байдал юм. Нэмж дурдахад, ADHD, сэтгэлийн түгшүүр, ADD, төгс төгөлдөр байдал, бүтэлгүйтэхээс айх, сэтгэл гутрал гэх мэт зарим саад тотгор байдаг.
                Хэрэв танд өмнө дурдсан сэтгэцийн эмгэгийн талаар асуулт байвал манай блогийн "Сэтгэцийн эрүүл мэнд" гэсэн хэсгийг үзээрэй. (Холбоос: энд оруулаарай хаха)`],
            }
        ]
    }
    return (
        
        <BlogTemp data={data}/>
    );
}